2. Refer the dataset "Advertising.csv" and perform following tasks.
i) Read the dataset "Advertising.csv" in data frame.

ii) Print first five records of dataset.

iii) print last five records from dataset.

iv) display the column names of the dataset.

v) display last three records from dataset.

vi) display the information about the dataset.

vii) display data types of each columns.
 
viii) check for null values in the dataset and display the sum of null values inside the column.

ix) drop all null values.

x) drop a column 'radio' from a dataset and display first ten records.

xi) increase the sales by 10% and add a new column "updated_sales" in dataframe.

xii) display shape of data.

In [1]:
import numpy as np
import pandas as pd

i) Read the dataset "Advertising.csv" in data frame.

In [4]:
df = pd.read_csv("Advertising.csv")

ii) Print first five records of dataset.

In [6]:
df.head(5)

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

iii) print last five records from dataset.

In [7]:
df.tail(5)

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [ ]:
iv) display the column names of the dataset.

In [8]:
df.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [ ]:

v) display last three records from dataset.

In [9]:
df.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4


vi) display the information about the dataset.

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB


vii) display data types of each columns.

In [13]:
df.dtypes

TV           float64
radio        float64
newspaper    float64
sales        float64
dtype: object


 
viii) check for null values in the dataset and display the sum of null values inside the column.

In [19]:
df.isna()

        TV  radio  newspaper  sales
0    False  False      False  False
1    False  False      False  False
2    False  False      False  False
3    False  False      False  False
4    False  False      False  False
..     ...    ...        ...    ...
195  False  False      False  False
196  False  False      False  False
197  False  False      False  False
198  False  False      False  False
199  False  False      False  False

[200 rows x 4 columns]

In [20]:
df.isna().sum()

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

ix) drop all null values.

In [21]:
df.dropna()

        TV  radio  newspaper  sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

x) drop a column 'radio' from a dataset and display first ten records.

In [26]:
df.drop(columns=['radio'])
df.head()

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9


xi) increase the sales by 10% and add a new column "updated_sales" in dataframe.

In [34]:
updated_sales = df['sales'] + (0.1)*df['sales']

In [37]:
df.assign(updated_sales=updated_sales)

        TV  radio  newspaper  sales  updated_sales
0    230.1   37.8       69.2   22.1          24.31
1     44.5   39.3       45.1   10.4          11.44
2     17.2   45.9       69.3    9.3          10.23
3    151.5   41.3       58.5   18.5          20.35
4    180.8   10.8       58.4   12.9          14.19
..     ...    ...        ...    ...            ...
195   38.2    3.7       13.8    7.6           8.36
196   94.2    4.9        8.1    9.7          10.67
197  177.0    9.3        6.4   12.8          14.08
198  283.6   42.0       66.2   25.5          28.05
199  232.1    8.6        8.7   13.4          14.74

[200 rows x 5 columns]

xii) display shape of data

In [39]:
df.shape

(200, 4)